---
kind: property
id: P:Autodesk.Revit.DB.Analysis.EnergyAnalysisMaterial.MaterialName
source: html/7c6ffe70-0e1f-709a-7f3b-f6deaf3ffa7c.htm
---
# Autodesk.Revit.DB.Analysis.EnergyAnalysisMaterial.MaterialName Property

The name of the material.

## Syntax (C#)
```csharp
public string MaterialName { get; }
```